---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemXDistance
source: html/d9fa2042-38ac-ee33-65d9-5d94466e3df4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemXDistance Property

"Side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemXDistance { get; }
```